{
	"@comment": "Note that the code to transform these data into a webpage is in https://github.com/Schnark/schnark.github.io",
	"title": {
		"en": "Day calendar – App for Firefox OS",
		"de": "Tageskalender – App für Firefox OS"
	},
	"serviceworker": true,
	"icon": "img/icon128.png",
	"screenshots": [
		"2016-10-19-10-17-47.png",
		"2016-10-19-10-18-13.png",
		"2016-10-19-10-18-37.png",
		"2016-10-19-10-18-52.png",
		"2016-10-19-10-19-35.png",
		"2016-10-19-10-19-52.png"
	],
	"desc": {
		"en": "<p>This day calendar shows additional information for every day.</p><h3>Usage</h3><ul><li><b>Day view</b><ul><li>Browse by swiping left or right</li><li>Select date with buttons at the end of the screen</li></ul></li><li><b>Month view</b><ul><li>Browse by swiping left or right</li><li>Change to day view by tapping the date</li></ul></li><li><b>Search</b><ul><li>Start with the magnifying glass at the start of the screen</li><li>Case insensitive</li><li>In day view will show next matching date</li><li>While browsing only matching dates are shown</li><li>In month view matching dates are highlighted</li></ul></li><li><b>Configuration</b><ul><li>Start with cog symbol at the start of the screen</li><li>Language (including English)</li><li>Region (for display of holidays)</li><li>Holidays and commemorative days configurable in different stages</li><li>Optional: location for times for sunrise, sunset, moonrise and moonset</li><li>Optional: phase of the moon and sign of zodiac which it is in</li></ul></li></ul><h3>Caveats</h3><ul><li>It cannot be connected with the default calendar app.</li><li>The data can (and will) contain errors and omissions. Especially the religious holidays and commemorative days are mostly catholic ones, most secular commemorative days are still missing. If you notice something I should change, just write an email to me.</li><li>Though translations into other languages are possible, the app currently only has German and an incomplete English translation. If you want to help me to add another translation, just open a GitHub issue.</li><li>Though holidays can be shown for any country, currently there are only data for Germany (and to some degree Switzerland, Liechtenstein and Austria). If you want to use this app in another country, just open a GitHub issue.</li></ul>",
		"de": "<p>Dieser Tageskalender liefert für jeden Tag viele zusätzliche Informationen.</p><h3>Benutzung</h3><ul><li><b>Tagesansicht</b><ul><li>Blättern durch Wischgesten nach links oder rechts</li><li>Direktauswahl des Datums am unteren Bildschirmrand</li></ul></li><li><b>Monatsübersicht</b><ul><li>Blättern durch Wischen nach links oder rechts</li><li>Wechsel zur Tagesansicht durch Antippen des gewünschten Datums</li></ul></li><li><b>Suche</b><ul><li>Starten über Lupensymbol am oberen Bildschirmrand</li><li>unterscheidet nicht zwischen Groß- und Kleinschreibung</li><li>wechselt in Tagesansicht zum nächsten passenden Datum</li><li>beim Blättern werden nur passende Daten angezeigt</li><li>in Monatsübersicht werden passende Daten hervorgehoben</li></ul></li><li><b>Konfiguration</b><ul><li>Aufruf über Zahnradsymbol am oberen Bildschirmrand</li><li>Sprache (inkl. österreichischem und Schweizer Deutsch)</li><li>Region (für Anzeige der Feiertage)</li><li>Feier- und Gedenktage in mehreren Stufen einstellbar</li><li>optional: Ort für Auf- und Untergangszeiten von Sonne und Mond</li><li>optional: Mondphase und Tierkreiszeichen, in dem der Mond sich befindet</li></ul></li></ul><h3>Einschränkungen</h3><ul><li>Es gibt keine Verknüpfung mit der Standard-Kalender-App.</li><li>Die Daten können (und werden) Fehler und Lücken enthalten. Insbesondere sind bei den religiösen Feier- und Gedenktagen fast ausschließlich nur katholische vorhanden, säkulare Gedenktage sind nur sehr lückenhaft. Falls dir etwas auffällt, was ich ändern soll, dann schick mir eine E-Mail.</li><li>Die Verdrängung von christlichen Hochfesten durch höherrangige gemäß dem Direktorium der römisch-katholischen Kirche ist nicht implementiert.</li><li>Obwohl Übersetzungen in andere Sprachen prinzipiell möglich sind, gibt es im Augenblick neben den deutschen Texten nur eine nicht vollständige englische Lokalisierung. Falls du mir beim Übersetzen in eine andere Sprache helfen willst, dann erstelle ein GitHub-Ticket.</li><li>Obwohl Feiertage für beliebige Staaten (innerhalb der oben genannten Einschränkungen) prinzipiell möglich sind, stehen im Augenblick nur Daten für Deutschland (und in geringerem Umfang für Schweiz, Liechtenstein und Österreich) zur Verfügung. Falls du die App gerne für ein anderes Land verwenden möchtest, dann erstelle ein GitHub-Ticket.</li></ul>"
	}
}